/*using ValueTypes_ReferenceTypes;

Задание 1: Разница между struct и class

Coordinate coord1 = new Coordinate(10, 20);
Coordinate coord2 = coord1;
coord2.X = 30;

Console.WriteLine($"[Структура] Данные до копирования: {coord1.X}, {coord1.Y}");
Console.WriteLine($"[Структура] Данные после копирования: {coord2.X}, {coord2.Y}\n");

Person person1 = new Person("alice", 25);
Person person2 = person1;
person2.Name = "Bob";

Console.WriteLine($"[Класс] Данные до копирования: {person1.Name}, {person1.Age}");
Console.WriteLine($"[Класс] Данные после копирования: {person2.Name}, {person2.Age}");*/







